//看看大佬的出局思路================
//#include <stdio.h>
//int main (void){
//    int n,k,m;
//    scanf("%d %d %d",&n,&k,&m);
//    int a [n];
//    for(int i = 0;i<n;i++){
//        a[i]=i;//==========================把玩家放进数组里； 
//    }
//    int flag = 0;
//    int cot = 1;
//    int i = k;//============刚开始从k数 
//    while(flag<n-1){//================================当出局人数达n-2时停止比赛 
//        for(;i<n;i++){
//            if(cot==m&&a[i]<n){//===========================
//                a[i]=n+1;//=================================\\玩家a[i]出局利用=n+1 
//                cot=1;flag++;
//            }else if(a[i]<n){//=============================所以条件是在<n的玩家才能使cot++; 
//                cot++;
//            }
//        }
//        i=0;//==============之后的都从0位开始... 
//    }
//    for(i=0;i<n;i++){
//        if(a[i]<n){//==============================唯有<n的玩家获胜... 
//            printf("%d",a[i]);
//        }
//    }
//}




////#include<stdio.h>
////int main (){
////	int n,m,k;
////    int f,i,o,l;
////    int a[101]={0};
////    scanf("%d %d %d",&n,&k,&m);
////    o=k+m-1;
////    l=n;
////    while(n!=1){
////    	
////        if(o<=n){
////            a[o]=1;
////            o+=m;
////            n--;
////        }
////        else {
////            f=o-l;
////            o=f;
////            a[f]=1;
////            o+=m;
////            n--;
////        }
////    }
////    for(i=1;i<=l;i++){
////        if(a[i]==0){
////            printf("%d\n",i);
////        }
////    }
////    
////	return 0;//==================整体结构相似但没有想到出局方法，是故失败 
////}

#include<stdio.h>
int main (){
	int n,m,k;
    int f,i,o,l;
    int a[101]={0};
    scanf("%d %d %d",&n,&k,&m);
    o=k+m-1;
    l=n;
    while(n!=1){
    	
        if(o<=n){
            a[o]=1;
            o+=m;
            n--;
        }
        else {
            f=o-l;
            o=f;
            a[f]=1;
            o+=m;
            n--;
        }
    }
    for(i=1;i<=l;i++){
        if(a[i]==0){
            printf("%d\n",i);
        }
    }
    
	return 0;//==================整体结构相似但没有想到出局方法，是故失败 ... 重试 
}


